#include <iostream>
using namespace std;

union OBYEDINENIE {
	short int sh;
	int i;
	float f;
};

int main() {
	OBYEDINENIE obj; // union создает область в памяти, размер которой соответствует самому большому типу в объединении.
	obj.sh = 1; // После этого, можно эту память заполнить.
	obj.i = 51245; // Последующие действия её перезаписывают.
	obj.f = 1.13;

	/*
	К старым полям объединения можно обращаться, но вывод будет некорректным. [][][][] - 4 байта занимает тип float. Если обратиться к short int - возьмутся первые 2 байта и проинтерпретируются как
	short int
	*/

	return 0;
}