#include <iostream>
using namespace std;

/*
main является точкой входа в программу. Дело в том, что запускать программу можно с указанием параметров.
Эти параметры имеют тип multichar. К примеру, можно ввести в консоль Main_Params.exe Param2.
Даже если не указывать параметр, первым в функцию передастся путь к этому файлу. Если указать Param2, то вторым
параметром будет -t. В зависимости от переданных параметров можно менять принцип работы функции.

https://www.youtube.com/watch?v=SEJjSo4qkl8&list=PLQOaTSbfxUtCrKs0nicOg2npJQYSPGO9r&index=83
*/

int main(int argc, char* argv[]) { // Функция main должна быть int согласно стандарту
	for (int i = 0; i < argc; i++) {
		cout << argv[i];
	}

	return 0; /* В разных местах программы функция main может возвращать разное значение. Работа программы
	Считается корректной, если возвращается число 0. Если в main программистом предусмотрен возврат другого числа,
	тогда он может этим сказать, что при работе программы что-то пошло не так.
	*/
}